MyHome/src/Enums/ТипыКошельковИСчетов/ТипыКошельковИСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКошельковИСчетов</name>
  <enumValues>
    <name>Наличность</name>
  </enumValues>
  <enumValues>
    <name>ДебетоваяБанковскаяКарта</name>
  </enumValues>
  <enumValues>
    <name>КредитнаяБанковскаяКарта</name>
  </enumValues>
  <enumValues>
    <name>БанковскийСчет</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйКошелек</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

MyHome/src/Enums/ТипыКошельковИСчетов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ТипыКошельковСобственныхСредств() Экспорт

	МассивТипов = Новый Массив;
	
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКошельковИСчетов.БанковскийСчет"));
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКошельковИСчетов.ДебетоваяБанковскаяКарта"));
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКошельковИСчетов.Наличность"));
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКошельковИСчетов.ЭлектронныйКошелек"));
	
	Возврат МассивТипов;
	
КонецФункции

Функция ТипыКошельковЗаемныхСредств() Экспорт
	
	МассивТипов = Новый Массив;
	
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКошельковИСчетов.КредитнаяБанковскаяКарта"));
	
	Возврат МассивТипов;
	
КонецФункции		

#КонецЕсли
